tests/stubs/transacao.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.sis.sermepa.es">
  <soapenv:Header/>
  <soapenv:Body>
    <web:trataPeticion>
      <web:datoEntrada><![CDATA[<DATOSENTRADA><DS_MERCHANT_AMOUNT>1000</DS_MERCHANT_AMOUNT><DS_MERCHANT_ORDER>ABC123456123</DS_MERCHANT_ORDER><DS_MERCHANT_MERCHANTCODE>1234567</DS_MERCHANT_MERCHANTCODE><DS_MERCHANT_TERMINAL>12301233</DS_MERCHANT_TERMINAL><DS_MERCHANT_CURRENCY>986</DS_MERCHANT_CURRENCY><DS_MERCHANT_PAN>4111111111111111</DS_MERCHANT_PAN><DS_MERCHANT_EXPIRYDATE>2012</DS_MERCHANT_EXPIRYDATE><DS_MERCHANT_CVV2>123</DS_MERCHANT_CVV2><DS_MERCHANT_TRANSACTIONTYPE>A</DS_MERCHANT_TRANSACTIONTYPE><DS_MERCHANT_ACCOUNTTYPE>01</DS_MERCHANT_ACCOUNTTYPE><DS_MERCHANT_MERCHANTSIGNATURE>d8ca63ac18fbb7a8c3669e18b506e2c109f8b7ea9ec80b33aa40b5254a1b424a</DS_MERCHANT_MERCHANTSIGNATURE></DATOSENTRADA>]]></web:datoEntrada>
    </web:trataPeticion>
  </soapenv:Body>
</soapenv:Envelope>
